### Terraform Plan for Test 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.app.module.ssr_task.aws_ecs_task_definition.task[0] will be created
  + resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = []
                  + essential        = true
                  + image            = "637423315721.dkr.ecr.eu-west-1.amazonaws.com/designmanual:434dc39738948ddf2bff8c6372bbe28f87272d63"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "digitalekanaler-designmanual"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "digitalekanaler-designmanual-main"
                        }
                    }
                  + mountPoints      = []
                  + name             = "digitalekanaler-designmanual-main"
                  + portMappings     = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "VITE_ENVIRONMENT"
                          + valueFrom = "arn:aws:ssm:eu-west-1:590183702222:parameter/__digitalekanaler-designmanual__/env_vars/VITE_ENVIRONMENT"
                        },
                      + {
                          + name      = "VITE_PUBLIC_SANITY_STUDIO_URL"
                          + valueFrom = "arn:aws:ssm:eu-west-1:590183702222:parameter/__digitalekanaler-designmanual__/env_vars/VITE_PUBLIC_SANITY_STUDIO_URL"
                        },
                      + {
                          + name      = "VITE_SANITY_SECRET"
                          + valueFrom = "arn:aws:ssm:eu-west-1:590183702222:parameter/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_SECRET"
                        },
                      + {
                          + name      = "VITE_SANITY_STUDIO_URL"
                          + valueFrom = "arn:aws:ssm:eu-west-1:590183702222:parameter/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_STUDIO_URL"
                        },
                      + {
                          + name      = "VITE_SANITY_TOKEN"
                          + valueFrom = "arn:aws:ssm:eu-west-1:590183702222:parameter/__digitalekanaler-designmanual__/env_vars/VITE_SANITY_TOKEN"
                        },
                    ]
                  + systemControls   = []
                  + volumesFrom      = []
                },
            ]
        )
      + cpu                      = "2048"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::590183702222:role/digitalekanaler-designmanual-task-execution-role"
      + family                   = "digitalekanaler-designmanual"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + region                   = "eu-west-1"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "application" = "digitalekanaler-designmanual"
          + "repo"        = "spor"
          + "terraform"   = "true"
        }
      + task_role_arn            = "arn:aws:iam::590183702222:role/digitalekanaler-designmanual-task-role"
      + track_latest             = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit d339cde0a20009e16d5e74dc08382af37a71b72c*
*Plan generated at: 2025-11-12 15:18:12 UTC*
